# 5-3 과제
# 1. 인구수 추계자료 - 선 그래프
Year = 2015:2026
Population = c(51014,51245,51446,51635,51811,
               51973,32123,52261,52338,52504,52609,52704)
plot(Year, Population,
     type = 'l')

# 2. 남,여 경제활동 참가율 - 선 그래프
period = c('20144', '20151', '20152', '20153', '20154',
           '20161', '20162', '20163', '20164',
           '20171', '20172', '20173')
man = c(73.9,73.1,74.4,74.2,73.5,73,74.2,74.5,73.8,
        73.1,74.5,74.2)
woman = c(51.4,50.5,52.4,52.4,51.9,
          50.9,52.6,52.7,52.2,51.5,53.2,53.1)
plot(period, man, type="b", col="blue",      
     main = '남,녀 경제활동참가율',      
     lty = 1, lwd = 1, xlab = "분기", ylab = "경제활동 참가율",
     ylim = c(50, 80))
lines(period, woman, type="b", col="red")
