d1 <- 1:50
d2 <- 51:100

#1. d1, d2 의 값을 보이시오
d1
d2

#2. d1+d2, d2-d1, d1*d2, d2/d1 의 결과를 각각 보이시오.
d1+d2
d2-d1
d1*d2
d2/d1

#3. d1, d2 의 값들의 합(sum)을 각각 보이시오
sum(d1)
sum(d2)

#4. d1, d2 에 있는 모든 값들의 합(sum)을 보이시오.
sum(d1, d2)

#5. d2 에서 가장 큰 값과 가장 작은 값을 보이시오.
max(d2)

#6. d2 와 d1 의 값들의 평균값을 각각 구하고 
#   두 평균의 차이를 보이시오.
mean(d1)
mean(d2)
mean(d2)-mean(d1)

#7.  d1 의 값들을 큰수에서 
#    작은 수 순으로 정렬하여 보이시오
sort(d1, decreasing = T)

#8. d1 과 d2 에서 큰수 순으로 각각 10개씩을 추출하여 
# d3 에 저장하시오. 
#(결과적으로 d3 에는 20개의 수가 저장)  

